In [3]:
!pip install -r ../requirements.txt

Collecting pandas==2.2.3 (from -r ../requirements.txt (line 1))
  Obtaining dependency information for pandas==2.2.3 from https://files.pythonhosted.org/packages/52/11/9eac327a38834f162b8250aab32a6781339c69afe7574368fffe46387edf/pandas-2.2.3-cp311-cp311-macosx_11_0_arm64.whl.metadata
  Using cached pandas-2.2.3-cp311-cp311-macosx_11_0_arm64.whl.metadata (89 kB)
Collecting numpy>=1.23.2 (from pandas==2.2.3->-r ../requirements.txt (line 1))
  Obtaining dependency information for numpy>=1.23.2 from https://files.pythonhosted.org/packages/4d/1a/e85f0eea4cf03d6a0228f5c0256b53f2df4bc794706e7df019fc622e47f1/numpy-2.3.5-cp311-cp311-macosx_14_0_arm64.whl.metadata
  Using cached numpy-2.3.5-cp311-cp311-macosx_14_0_arm64.whl.metadata (62 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/macbookpro/project/tux-project/2025-System-Analysis/.venv/lib/python3.11/site-packages (from pandas==2.2.3->-r ../requirements.txt (line 1)) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas==2.2.3->-r ../requirements.txt (line 1))
  Obtaining dependency information for pytz>=2020.1 from https://files.pythonhosted.org/packages/81/c4/34e93fe5f5429d7570ec1fa436f1986fb1f00c3e0f43a589fe2bbcd22c3f/pytz-2025.2-py2.py3-none-any.whl.metadata
  Using cached pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas==2.2.3->-r ../requirements.txt (line 1))
  Obtaining dependency information for tzdata>=2022.7 from https://files.pythonhosted.org/packages/5c/23/c7abc0ca0a1526a0774eca151daeb8de62ec457e77262b66b359c3c7679e/tzdata-2025.2-py2.py3-none-any.whl.metadata
  Using cached tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in /Users/macbookpro/project/tux-project/2025-System-Analysis/.venv/lib/python3.11/site-packages (from python-dateutil>=2.8.2->pandas==2.2.3->-r ../requirements.txt (line 1)) (1.17.0)
Using cached pandas-2.2.3-cp311-cp311-macosx_11_0_arm64.whl (11.3 MB)
Using cached numpy-2.3.5-cp311-cp311-macosx_14_0_arm64.whl (5.4 MB)
Using cached pytz-2025.2-py2.py3-none-any.whl (509 kB)
Using cached tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, numpy, pandas
Successfully installed numpy-2.3.5 pandas-2.2.3 pytz-2025.2 tzdata-2025.2

[notice] A new release of pip is available: 23.2.1 -> 25.3
[notice] To update, run: pip install --upgrade pip

In [4]:
import pandas as pd


# Series

In [6]:
animals = ["Cat", "Dog", "Pig"]
type(animals)

list

In [8]:
animal_series = pd.Series(animals, name="Animals")
animal_series

0    Cat
1    Dog
2    Pig
Name: Animals, dtype: object

In [9]:
num = [1, 2, 3]
num_series = pd.Series(num, name="Numbers")
num_series

0    1
1    2
2    3
Name: Numbers, dtype: int64

In [10]:
num = [1.0, 2, 3]
num_series_float = pd.Series(num, name="Numbers")
num_series_float

0    1.0
1    2.0
2    3.0
Name: Numbers, dtype: float64

In [11]:
num = [1.0, None, 3]
num_series_float = pd.Series(num, name="Numbers")
num_series_float

0    1.0
1    NaN
2    3.0
Name: Numbers, dtype: float64

In [12]:
animals = ["Cat", "Dog", "Pig", None]
animal_series = pd.Series(animals, name="Animals")
animal_series

0     Cat
1     Dog
2     Pig
3    None
Name: Animals, dtype: object

In [13]:
person = {"name": "John", "age": 20, "city": "New York"}
person_series = pd.Series(person, name="Person")
person_series

name        John
age           20
city    New York
Name: Person, dtype: object

# Search / Query

In [15]:
nums = [1, 2, 3, 4, 5]
nums_series = pd.Series(nums, name="Numbers")
nums_series[nums_series >= 3]

2    3
3    4
4    5
Name: Numbers, dtype: int64

In [21]:
animals = ["Cat", "Dog", "Pig", "Cow", None]
animal_series = pd.Series(animals, name="Animals")
animal_series[animal_series=="Cat"]

0    Cat
Name: Animals, dtype: object

In [22]:
animal_series[animal_series.fillna('').str.startswith("C")]

0    Cat
3    Cow
Name: Animals, dtype: object

In [23]:
countries = {"sg": "Singapore", "us": "United States", "cn": "China"}
countries_series = pd.Series(countries, name="Countries")
countries_series

sg        Singapore
us    United States
cn            China
Name: Countries, dtype: object

In [24]:
countries_series.iloc[2]

'China'

In [25]:
countries_series["cn"]

'China'

In [26]:
countries_series[2]

/var/folders/hg/mnmq23nj1rjf5d6whxf0w9pm0000gn/T/ipykernel_13563/364909165.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  countries_series[2]

'China'

In [29]:
c_series = pd.Series({ 1: "China", 4: "United States", 3: "Canada"}, name="Countries")
c_series

1            China
4    United States
3           Canada
Name: Countries, dtype: object

In [31]:
c_series[4]

'United States'

In [32]:
c_series.iloc[1]

'United States'

## Reset index

In [33]:
n = pd.Series([1,2,3,4,5], name="Countries")
m = pd.Series([6,7,8,9,10], name="Countries")
nm = pd.concat([n, m])

In [34]:
nm

0     1
1     2
2     3
3     4
4     5
0     6
1     7
2     8
3     9
4    10
Name: Countries, dtype: int64

In [38]:
nm = nm.reset_index(drop=True)

In [39]:
nm

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: Countries, dtype: int64

# Dataframe
## Create a dataframe

In [40]:

df = pd.DataFrame({
    "name": ["John", "Jane", "Jim"],
    "age": [20, 21, 22],
    "city": ["New York", "Los Angeles", "Chicago"]
})
df

   name  age         city
0  John   20     New York
1  Jane   21  Los Angeles
2   Jim   22      Chicago

In [43]:
df["age"] > 20

0    False
1     True
2     True
Name: age, dtype: bool

In [42]:
df[df["age"] > 20]

   name  age         city
1  Jane   21  Los Angeles
2   Jim   22      Chicago

In [44]:
df["age"]

0    20
1    21
2    22
Name: age, dtype: int64

In [45]:
df.age

0    20
1    21
2    22
Name: age, dtype: int64

In [46]:
df["age", "city"]

KeyError: ('age', 'city')

In [47]:
df[["age", "city"]]

   age         city
0   20     New York
1   21  Los Angeles
2   22      Chicago

In [48]:
df[["age"]]

   age
0   20
1   21
2   22

In [49]:
df["age"]

0    20
1    21
2    22
Name: age, dtype: int64

In [51]:
select_row = [False, True, False]
df[select_row]

   name  age         city
1  Jane   21  Los Angeles

In [52]:
# Slicing

In [58]:
!pip install -r ../requirements.txt

Requirement already satisfied: pandas==2.2.3 in /Users/macbookpro/project/tux-project/2025-System-Analysis/.venv/lib/python3.11/site-packages (from -r ../requirements.txt (line 1)) (2.2.3)
Collecting openpyxl (from -r ../requirements.txt (line 2))
  Obtaining dependency information for openpyxl from https://files.pythonhosted.org/packages/c0/da/977ded879c29cbd04de313843e76868e6e13408a94ed6b987245dc7c8506/openpyxl-3.1.5-py2.py3-none-any.whl.metadata
  Using cached openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Requirement already satisfied: numpy>=1.23.2 in /Users/macbookpro/project/tux-project/2025-System-Analysis/.venv/lib/python3.11/site-packages (from pandas==2.2.3->-r ../requirements.txt (line 1)) (2.3.5)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/macbookpro/project/tux-project/2025-System-Analysis/.venv/lib/python3.11/site-packages (from pandas==2.2.3->-r ../requirements.txt (line 1)) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /Users/macbookpro/project/tux-project/2025-System-Analysis/.venv/lib/python3.11/site-packages (from pandas==2.2.3->-r ../requirements.txt (line 1)) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /Users/macbookpro/project/tux-project/2025-System-Analysis/.venv/lib/python3.11/site-packages (from pandas==2.2.3->-r ../requirements.txt (line 1)) (2025.2)
Collecting et-xmlfile (from openpyxl->-r ../requirements.txt (line 2))
  Obtaining dependency information for et-xmlfile from https://files.pythonhosted.org/packages/c1/8b/5fe2cc11fee489817272089c4203e679c63b570a5aaeb18d852ae3cbba6a/et_xmlfile-2.0.0-py3-none-any.whl.metadata
  Using cached et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Requirement already satisfied: six>=1.5 in /Users/macbookpro/project/tux-project/2025-System-Analysis/.venv/lib/python3.11/site-packages (from python-dateutil>=2.8.2->pandas==2.2.3->-r ../requirements.txt (line 1)) (1.17.0)
Using cached openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
Using cached et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5

[notice] A new release of pip is available: 23.2.1 -> 25.3
[notice] To update, run: pip install --upgrade pip

In [59]:
df = pd.read_excel("./datasets/01-attendantsheet-sample.xlsx")
df

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Student Attendance Sheet,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 28,Unnamed: 29,Unnamed: 30,Unnamed: 31,Unnamed: 32,Unnamed: 33,Unnamed: 34,Unnamed: 35,Unnamed: 36,Unnamed: 37
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,Instructor: So Vengleab ...,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,Date: (MM/DD),NaN,NaN,NaN,2025-06-21 00:00:00,2025-06-21 00:00:00,2025-06-28 00:00:00,2025-06-28 00:00:00,2025-07-05 00:00:00,2025-07-05 00:00:00,...,2025-09-27 00:00:00,2025-09-27 00:00:00,2025-10-04 00:00:00,2025-10-04 00:00:00,2025-10-11 00:00:00,2025-10-11 00:00:00,Total,NaN,NaN,NaN
7,No.,Name,Sex,Course,S1,S2,S3,S4,S5,S6,...,S25,S26,S27,S28,S29,S30,P,E,L,A
8,1,Chan Panha,M,AW,P,P,A,A,P,P,...,E,E,P,P,E,E,12,10,0,8
9,2,Chum Ratanakchentria,F,AW,P,P,E,E,A,A,...,NaN,NaN,NaN,NaN,NaN,NaN,2,2,0,8
10,3,Eang Montra,F,AW,A,A,P,P,L,P,...,P,P,E,E,P,P,23,4,1,2
11,4,Eung Laimeng,M,AW,A,A,E,E,P,P,...,A,A,A,A,A,A,13,6,1,10
12,5,Soeun Kongsovann,M,AW,P,P,E,E,P,P,...,L,P,P,P,P,P,21,4,1,4
13,6,Kril Darith,M,AW,P,P,P,P,P,P,...,L,P,P,P,P,P,25,4,1,0
14,7,Mao Kolbotr Pisssoth,M,AW,L,P,P,P,L,P,...,E,E,A,A,P,P,15,10,3,2
15,8,Ny Clinton,M,AW,P,P,P,P,P,P,...,P,P,P,P,P,P,26,4,0,0
16,9,Phok Keomonnyratanak,M,USB1,NaN,NaN,A,A,L,P,...,A,A,A,A,A,A,3,12,1,12
17,10,Rith Sokha Neadh,M,USB2,NaN,NaN,P,P,P,P,...,A,A,P,P,P,P,20,6,0,2
18,11,Sat Dona,M,USB3,NaN,NaN,L,P,P,P,...,A,A,P,P,P,P,23,2,1,2
19,12,SOPHEAP Neary,M,USB4,NaN,NaN,L,P,L,P,...,A,A,A,A,A,A,12,4,2,10
20,13,Srun Chanmonika,F,USB5,NaN,NaN,L,P,L,P,...,A,A,P,P,P,P,16,8,2,2
21,15,Tem Lyhor,M,USB9,NaN,NaN,A,A,A,A,...,NaN,NaN,NaN,NaN,NaN,NaN,0,0,NaN,10
22,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
23,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
24,Legend: ...,NaN,NaN,NaN,P - Present ...,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
26,NaN,NaN,NaN,P,5,6,4,4,5,7,...,2,4,4,4,5,5,NaN,NaN,NaN,NaN
27,NaN,NaN,NaN,E,0,0,3,3,0,0,...,2,2,1,1,1,1,NaN,NaN,NaN,NaN
28,NaN,NaN,NaN,A,2,2,1,1,1,1,...,1,1,2,2,1,1,NaN,NaN,NaN,NaN

In [62]:
df.iloc[7:21, 0:34]

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Student Attendance Sheet,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 24,Unnamed: 25,Unnamed: 26,Unnamed: 27,Unnamed: 28,Unnamed: 29,Unnamed: 30,Unnamed: 31,Unnamed: 32,Unnamed: 33
7,No.,Name,Sex,Course,S1,S2,S3,S4,S5,S6,...,S21,S22,S23,S24,S25,S26,S27,S28,S29,S30
8,1,Chan Panha,M,AW,P,P,A,A,P,P,...,E,E,P,P,E,E,P,P,E,E
9,2,Chum Ratanakchentria,F,AW,P,P,E,E,A,A,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
10,3,Eang Montra,F,AW,A,A,P,P,L,P,...,P,P,E,E,P,P,E,E,P,P
11,4,Eung Laimeng,M,AW,A,A,E,E,P,P,...,P,P,L,P,A,A,A,A,A,A
12,5,Soeun Kongsovann,M,AW,P,P,E,E,P,P,...,E,E,P,P,L,P,P,P,P,P
13,6,Kril Darith,M,AW,P,P,P,P,P,P,...,P,P,P,P,L,P,P,P,P,P
14,7,Mao Kolbotr Pisssoth,M,AW,L,P,P,P,L,P,...,P,P,L,P,E,E,A,A,P,P
15,8,Ny Clinton,M,AW,P,P,P,P,P,P,...,P,P,E,E,P,P,P,P,P,P
16,9,Phok Keomonnyratanak,M,USB1,NaN,NaN,A,A,L,P,...,A,A,A,A,A,A,A,A,A,A
17,10,Rith Sokha Neadh,M,USB2,NaN,NaN,P,P,P,P,...,P,P,E,E,A,A,P,P,P,P
18,11,Sat Dona,M,USB3,NaN,NaN,L,P,P,P,...,P,P,P,P,A,A,P,P,P,P
19,12,SOPHEAP Neary,M,USB4,NaN,NaN,L,P,L,P,...,E,E,A,A,A,A,A,A,A,A
20,13,Srun Chanmonika,F,USB5,NaN,NaN,L,P,L,P,...,P,P,P,P,A,A,P,P,P,P

In [63]:
df[df.index==17]

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Student Attendance Sheet,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 28,Unnamed: 29,Unnamed: 30,Unnamed: 31,Unnamed: 32,Unnamed: 33,Unnamed: 34,Unnamed: 35,Unnamed: 36,Unnamed: 37
17,10,Rith Sokha Neadh,M,USB2,NaN,NaN,P,P,P,P,...,A,A,P,P,P,P,20,6,0,2

In [65]:
df.iloc[17]

Unnamed: 0                                10
Unnamed: 1                  Rith Sokha Neadh
Unnamed: 2                                 M
Unnamed: 3                              USB2
Student Attendance Sheet                 NaN
Unnamed: 5                               NaN
Unnamed: 6                                 P
Unnamed: 7                                 P
Unnamed: 8                                 P
Unnamed: 9                                 P
Unnamed: 10                                P
Unnamed: 11                                P
Unnamed: 12                                P
Unnamed: 13                                P
Unnamed: 14                                P
Unnamed: 15                                P
Unnamed: 16                                E
Unnamed: 17                                E
Unnamed: 18                                P
Unnamed: 19                                P
Unnamed: 20                                P
Unnamed: 21                                P
Unnamed: 22                                E
Unnamed: 23                                E
Unnamed: 24                                P
Unnamed: 25                                P
Unnamed: 26                                E
Unnamed: 27                                E
Unnamed: 28                                A
Unnamed: 29                                A
Unnamed: 30                                P
Unnamed: 31                                P
Unnamed: 32                                P
Unnamed: 33                                P
Unnamed: 34                               20
Unnamed: 35                                6
Unnamed: 36                                0
Unnamed: 37                                2
Name: 17, dtype: object

In [66]:
c1 = [1,2,3,4,5]
c2 = [6,7,8,9,10]
c3 = [11,12,13,14,15]
df = pd.DataFrame({
    "c1": c1,
    "c2": c2,
    "c3": c3,
})
df

   c1  c2  c3
0   1   6  11
1   2   7  12
2   3   8  13
3   4   9  14
4   5  10  15

In [67]:
df.mean()

c1     3.0
c2     8.0
c3    13.0
dtype: float64

In [68]:
df.mean(axis=1)

0     6.0
1     7.0
2     8.0
3     9.0
4    10.0
dtype: float64

In [69]:
df["avg"] = df.mean(axis=1)
df

   c1  c2  c3   avg
0   1   6  11   6.0
1   2   7  12   7.0
2   3   8  13   8.0
3   4   9  14   9.0
4   5  10  15  10.0

# Missing value

In [71]:


c1 = [1,2,3,4,5]
c2 = [6,7,None,9,10]
c3 = [11,12,13,14,15]
df = pd.DataFrame({
    "c1": c1,
    "c2": c2,
    "c3": c3,
})
df

   c1    c2  c3
0   1   6.0  11
1   2   7.0  12
2   3   NaN  13
3   4   9.0  14
4   5  10.0  15

In [72]:
df.dropna()

   c1    c2  c3
0   1   6.0  11
1   2   7.0  12
3   4   9.0  14
4   5  10.0  15

In [73]:
df.dropna(axis=1)

   c1  c3
0   1  11
1   2  12
2   3  13
3   4  14
4   5  15

In [74]:
df

   c1    c2  c3
0   1   6.0  11
1   2   7.0  12
2   3   NaN  13
3   4   9.0  14
4   5  10.0  15

In [75]:
df.fillna(0)

   c1    c2  c3
0   1   6.0  11
1   2   7.0  12
2   3   0.0  13
3   4   9.0  14
4   5  10.0  15

# Group by

In [77]:
data = pd.read_csv("./datasets/car-sales-extended.csv")
data.head()

     Make Colour  Odometer (KM)  Doors  Price
0   Honda  White          35431      4  15323
1     BMW   Blue         192714      5  19943
2   Honda  White          84714      4  28343
3  Toyota  White         154365      4  13434
4  Nissan   Blue         181577      3  14043

In [80]:
data.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price             int64
dtype: object

In [83]:
df = data[["Colour", "Price"]]

In [84]:
df.groupby("Colour").mean()

               Price
Colour
Black   15972.212121
Blue    16414.803738
Green   14811.455696
Red     15265.723404
White   16192.090909

In [85]:
df.groupby("Colour").sum()

          Price
Colour
Black   1581249
Blue    5269152
Green   1170105
Red     1434978
White   6590181

In [86]:
df.groupby("Colour").describe()

        Price                                                                \
        count          mean          std     min      25%      50%      75%
Colour
Black    99.0  15972.212121  8429.304680  3247.0  8684.50  15097.0  22849.0
Blue    321.0  16414.803738  8700.812027  2796.0  9648.00  14588.0  20867.0
Green    79.0  14811.455696  7225.774624  3125.0  9349.00  13637.0  19632.5
Red      94.0  15265.723404  7604.954756  4200.0  9697.25  14110.5  18019.0
White   407.0  16192.090909  9089.843911  3825.0  9388.00  14254.0  21006.5


            max
Colour
Black   37518.0
Blue    47260.0
Green   31343.0
Red     38060.0
White   52458.0

In [87]:
data

       Make Colour  Odometer (KM)  Doors  Price
0     Honda  White          35431      4  15323
1       BMW   Blue         192714      5  19943
2     Honda  White          84714      4  28343
3    Toyota  White         154365      4  13434
4    Nissan   Blue         181577      3  14043
..      ...    ...            ...    ...    ...
995  Toyota  Black          35820      4  32042
996  Nissan  White         155144      3   5716
997  Nissan   Blue          66604      4  31570
998   Honda  White         215883      4   4001
999  Toyota   Blue         248360      4  12732

[1000 rows x 5 columns]

In [88]:
data.groupby(["Make", "Colour"]).mean()

               Odometer (KM)     Doors         Price
Make   Colour
BMW    Black   147689.625000  4.250000  24706.000000
       Blue    113372.088235  4.294118  28845.058824
       Green   148823.500000  5.000000  19438.750000
       Red     119749.076923  5.000000  22510.230769
       White   123529.351351  4.675676  29255.675676
Honda  Black   142991.437500  4.000000  13926.031250
       Blue    130140.076923  4.000000  14107.019231
       Green   121674.888889  4.000000  17320.444444
       Red     116423.692308  4.000000  15180.615385
       White   117512.209677  4.000000  14460.403226
Nissan Black   143084.866667  4.000000  13601.000000
       Blue    135848.250000  3.716667  14078.483333
       Green   148961.250000  3.687500  12509.562500
       Red     138290.500000  3.722222  13069.166667
       White   130958.696629  3.808989  13710.505618
Toyota Black   121501.045455  4.000000  16680.750000
       Blue    144026.186992  4.000000  16069.764228
       Green   142524.945946  4.000000  13585.783784
       Red     138030.594595  4.000000  13848.756757
       White   130915.496815  4.000000  15887.872611

In [3]:
import pandas as pd
df = pd.DataFrame({
    "c1": [1,2,3,4,5],
    "c2": [6,7,None,None,10],
    "c3": [11,12,13,14,15],
})

In [4]:
df

   c1    c2  c3
0   1   6.0  11
1   2   7.0  12
2   3   NaN  13
3   4   NaN  14
4   5  10.0  15

In [7]:
new_DF = df.fillna(0)
new_DF

   c1    c2  c3
0   1   6.0  11
1   2   7.0  12
2   3   0.0  13
3   4   0.0  14
4   5  10.0  15

In [9]:
df.fillna(0, inplace=True)

In [10]:
df

   c1    c2  c3
0   1   6.0  11
1   2   7.0  12
2   3   0.0  13
3   4   0.0  14
4   5  10.0  15

In [ ]:
# Collection exercise

SyntaxError: invalid decimal literal (327020441.py, line 1)